# BuiltInFailures.SelectionFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SelectionFailures Class
BuiltInFailures Class Members See Also
---
Failures about Selections.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SelectionFailures
```

Visual Basic
---
```text
Public NotInheritable Class SelectionFailures
```

Visual C++
---
```text
public ref class SelectionFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SelectionFailures
# See Also
BuiltInFailures..::..SelectionFailures Members
Autodesk.Revit.DB Namespace